ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pic32cx1025mtc100_1.h
/* ---------------------------------------------------------------------------- */
/*                Microchip Microcontroller Software Support                    */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) %copyright_year%, Microchip Technology Inc.                    */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Microchip's name may not be used to endorse or promote products derived from */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  */
/* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES */
/* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    */
/* ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; */
/* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  */
/* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   */
/* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     */
/* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            */
/* ---------------------------------------------------------------------------- */

#ifndef _PIC32CX1025MTC100_
#define _PIC32CX1025MTC100_

/** \addtogroup PIC32CX1025MTC100_definitions PIC32CX1025MTC100 definitions
 * This file defines all structures and symbols for PIC32CX1025MTC100:
 *  - registers and bitfields
 *  - peripheral base address
 *  - peripheral ID
 *  - PIO definitions
 */
/*@{*/

#ifdef __cplusplus
extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR PIC32CX1025MTC100 */
/* ************************************************************************** */
/** \addtogroup PIC32CX1025MTC100_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn {
	/******  Cortex-M4 Processor Exceptions Numbers ******************************/
	NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
	HardFault_IRQn        = -13, /**<  3 HardFault Interrupt                   */
	MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
	BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
	UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
	SVCall_IRQn           = -5, /**< 11 Cortex-M4 SV Call Interrupt           */
	DebugMonitor_IRQn     = -4, /**< 12 Cortex-M4 Debug Monitor Interrupt     */
	PendSV_IRQn           = -2, /**< 14 Cortex-M4 Pend SV Interrupt           */
	SysTick_IRQn          = -1, /**< 15 Cortex-M4 System Tick Interrupt       */
	/******  PIC32CX1025MTC100 specific Interrupt Numbers *********************************/

	SUPC_IRQn            =  0, /**<  0 Supply Controller (SUPC) */
	RSTC_IRQn            =  1, /**<  1 Reset Controller (RSTC) */
	RTC_IRQn             =  2, /**<  2 Real Time Clock (RTC) */
	RTT_IRQn             =  3, /**<  3 Real Time Timer (RTT) */
	DWDT_IRQn            =  4, /**<  4 Dual Watchdog Timer (DWDT) */
	PMC_IRQn             =  6, /**<  6 Power Management Controller (PMC) */
	SEFC0_IRQn           =  7, /**<  7 Embedded Flash Controller 0 (SEFC0) */
	SEFC1_IRQn           =  8, /**<  8 Embedded Flash Controller 1 (SEFC1) */
	FLEXCOM0_IRQn        =  9, /**<  9 FLEXCOM 0 (USART0/SPI0/TWI0) (FLEXCOM0) */
	FLEXCOM1_IRQn        = 10, /**< 10 FLEXCOM 1 (USART1/SPI1/TWI1) (FLEXCOM1) */
	FLEXCOM2_IRQn        = 11, /**< 11 FLEXCOM 2 (USART2/SPI2/TWI2) (FLEXCOM2) */
	FLEXCOM3_IRQn        = 12, /**< 12 FLEXCOM 3 (USART3/SPI3/TWI3) (FLEXCOM3) */
	FLEXCOM4_IRQn        = 13, /**< 13 FLEXCOM 4 (USART4/SPI4/TWI4) (FLEXCOM4) */
	FLEXCOM5_IRQn        = 14, /**< 14 FLEXCOM 5 (USART5/SPI5/TWI5) (FLEXCOM5) */
	FLEXCOM6_IRQn        = 15, /**< 15 FLEXCOM 6 (USART6/SPI6/TWI6) (FLEXCOM6) */
	FLEXCOM7_IRQn        = 16, /**< 16 FLEXCOM 7 (USART7/SPI7/TWI7) (FLEXCOM7) */
	PIOA_IRQn            = 17, /**< 17 Application Core Parallel I/O Controller A (PIOA) (PIOA) */
	PIOA_SEC_IRQn        = 18, /**< 18 Application Core Parallel I/O Controller A (PIOA) Secure Event Interrupt (PIOA_SEC) */
	PIOB_IRQn            = 19, /**< 19 Application Core Parallel I/O Controller (B PIOB) (PIOB) */
	PIOB_SEC_IRQn        = 20, /**< 20 Application Core Parallel I/O Controller (B PIOB) Secure Event Interrupt (PIOB_SEC) */
	PIOC_IRQn            = 21, /**< 21 Application Core Parallel I/O Controller C (PIOC) (PIOC) */
	PIOC_SEC_IRQn        = 22, /**< 22 Application Core Parallel I/O Controller C (PIOC) Secure Event Interrupt (PIOC_SEC) */
	QSPI_IRQn            = 23, /**< 23 Quad IO Serial Peripheral Interface (QSPI) */
	ADC_IRQn             = 24, /**< 24 Analog To Digital Converter (ADC) */
	ACC_IRQn             = 25, /**< 25 Analog Comparator (ACC) */
	ARM0_FPU_IRQn        = 26, /**< 26 Application Core (CORE0) Floating Point Unit except IXC (ARM0_FPU) */
	ARM0_IXC_IRQn        = 27, /**< 27 Application Core (CORE0) FPU Interrupt IXC associated with FPU cumulative exception bit (ARM0_IXC) */
	IPC0_IRQn            = 28, /**< 28 Application Core Interprocessor communication (IPC0) (IPC0) */
	SLCDC_IRQn           = 29, /**< 29 Segment LCD Controller (SLCDC) */
	MEM2MEM0_IRQn        = 30, /**< 30 Application Core Memory to Memory Transfer Controller (MEM2MEM0) (MEM2MEM0) */
	TC0_CHANNEL0_IRQn    = 31, /**< 31 Timer Counter 0, Channel 0 (TC0_CHANNEL0) */
	TC0_CHANNEL1_IRQn    = 32, /**< 32 Timer Counter 0, Channel 1 (TC0_CHANNEL1) */
	TC0_CHANNEL2_IRQn    = 33, /**< 33 Timer Counter 0, Channel 2 (TC0_CHANNEL2) */
	TC1_CHANNEL0_IRQn    = 34, /**< 34 Timer Counter 1, Channel 0 (TC1_CHANNEL0) */
	TC1_CHANNEL1_IRQn    = 35, /**< 35 Timer Counter 1, Channel 1 (TC1_CHANNEL1) */
	TC1_CHANNEL2_IRQn    = 36, /**< 36 Timer Counter 1, Channel 2 (TC1_CHANNEL2) */
	TC2_CHANNEL0_IRQn    = 37, /**< 37 Timer Counter 2, Channel 0 (TC2_CHANNEL0) */
	TC2_CHANNEL1_IRQn    = 38, /**< 38 Timer Counter 2, Channel 1 (TC2_CHANNEL1) */
	TC2_CHANNEL2_IRQn    = 39, /**< 39 Timer Counter 2, Channel 2 (TC2_CHANNEL2) */
	TC0_C0SEC_IRQn       = 40, /**< 40 Timer Counter 0, Channel 0, Secure IRQ (TC0_C0SEC) */
	TC0_C1SEC_IRQn       = 41, /**< 41 Timer Counter 0, Channel 1, Secure IRQ (TC0_C1SEC) */
	TC0_C2SEC_IRQn       = 42, /**< 42 Timer Counter 0, Channel 2, Secure IRQ (TC0_C2SEC) */
	TC1_C0SEC_IRQn       = 43, /**< 43 Timer Counter 1, Channel 0, Secure IRQ (TC1_C0SEC) */
	TC1_C1SEC_IRQn       = 44, /**< 44 Timer Counter 1, Channel 1, Secure IRQ (TC1_C1SEC) */
	TC1_C2SEC_IRQn       = 45, /**< 45 Timer Counter 1, Channel 2, Secure IRQ (TC1_C2SEC) */
	TC2_C0SEC_IRQn       = 46, /**< 46 Timer Counter 2, Channel 0, Secure IRQ (TC2_C0SEC) */
	TC2_C1SEC_IRQn       = 47, /**< 47 Timer Counter 2, Channel 1, Secure IRQ (TC2_C1SEC) */
	TC2_C2SEC_IRQn       = 48, /**< 48 Timer Counter 2, Channel 2, Secure IRQ (TC2_C2SEC) */
	AES_IRQn             = 49, /**< 49 Advanced Enhanced Standard (AES) */
	AES_AESSEC_IRQn      = 50, /**< 50 AES Secure Event Interrupt (AES_AESSEC) */
	AESB_IRQn            = 51, /**< 51 AES Bridge (AESB) */
	AESB_AESBSEC_IRQn    = 52, /**< 52 AES Bridge Secure Interrupt (AESB_AESBSEC) */
	SHA_IRQn             = 53, /**< 53 Secure Hash Algorithm (SHA) */
	SHA_SHASEC_IRQn      = 54, /**< 54 SHA Secure Event Interrupt (SHA_SHASEC) */
	TRNG_IRQn            = 55, /**< 55 True Random Generator (TRNG) */
	TRNG_TRNGSEC_IRQn    = 56, /**< 56 TRNG Secure Event Interrupt (TRNG_TRNGSEC) */
	ICM_IRQn             = 57, /**< 57 Integrity Check Module (ICM) */
	ICM_ICMSEC_IRQn      = 58, /**< 58 Integrity Check Module (ICM_ICMSEC) */
	CPKCC_IRQn           = 59, /**< 59 Public Key Cryptography Controller (CPKCC) */
	MATRIX0_IRQn         = 60, /**< 60 High-Speed Application Core Matrix (HSACM) (MATRIX0) (MATRIX0) */
	MATRIX1_IRQn         = 61, /**< 61 Low-Speed Application Core Matrix (LSACM) (MATRIX1) (MATRIX1) */
	SUPC_WKUP3_IRQn      = 62, /**< 62 External interrupt 3 (SUPC_WKUP3) */
	SUPC_WKUP4_IRQn      = 63, /**< 63 External interrupt 4 (SUPC_WKUP4) */
	SUPC_WKUP5_IRQn      = 64, /**< 64 External interrupt 5 (SUPC_WKUP5) */
	SUPC_WKUP6_IRQn      = 65, /**< 65 External interrupt 6 (SUPC_WKUP6) */
	SUPC_WKUP7_IRQn      = 66, /**< 66 External interrupt 7 (SUPC_WKUP7) */
	SUPC_WKUP8_IRQn      = 67, /**< 67 External interrupt 8 (SUPC_WKUP8) */
	SUPC_WKUP9_IRQn      = 68, /**< 68 External interrupt 9 (SUPC_WKUP9) */
	SUPC_WKUP10_IRQn     = 69, /**< 69 External interrupt 10 (SUPC_WKUP10) */
	SUPC_WKUP11_IRQn     = 70, /**< 70 External interrupt 11 (SUPC_WKUP11) */
	SUPC_WKUP12_IRQn     = 71, /**< 71 External interrupt 12 (SUPC_WKUP12) */
	SUPC_WKUP13_IRQn     = 72, /**< 72 External interrupt 13 (SUPC_WKUP13) */
	SUPC_WKUP14_IRQn     = 73, /**< 73 External interrupt 14 (SUPC_WKUP14) */
	SUPC_WKUP15_IRQn     = 74, /**< 74 External interrupt 15 (SUPC_WKUP15) */
	SEAFEC_SLINK_IRQn    = 76, /**< 76 Smart Energy Analog Front-End Controller Serial Link Interrupt (SEAFEC_SLINK) */
	SEAFEC_DATA_IRQn     = 77, /**< 77 Smart Energy Analog Front-End Controller Data Ready Interrupt (SEAFEC_DATA) */
	MEM2MEM1_IRQn        = 78, /**< 78 Metrology Core Memory to Memory Transfer Controller 1 (MEM2MEM1) (MEM2MEM1) */
	TC3_CHANNEL0_IRQn    = 79, /**< 79 Timer Counter 3, Channel 0 (TC3_CHANNEL0) */
	TC3_CHANNEL1_IRQn    = 80, /**< 80 Timer Counter 3, Channel 1 (TC3_CHANNEL1) */
	TC3_CHANNEL2_IRQn    = 81, /**< 81 Timer Counter 3, Channel 2 (TC3_CHANNEL2) */
	TC3_C0SEC_IRQn       = 82, /**< 82 Timer Counter 3, Channel 0, Secure IRQ (TC3_C0SEC) */
	TC3_C1SEC_IRQn       = 83, /**< 83 Timer Counter 3, Channel 1, Secure IRQ (TC3_C1SEC) */
	TC3_C2SEC_IRQn       = 84, /**< 84 Timer Counter 3, Channel 2, Secure IRQ (TC3_C2SEC) */
	PIOD_IRQn            = 85, /**< 85 Metrology Core Parallel I/O Controller D (PIOD) (PIOD) */
	PIOD_SEC_IRQn        = 86, /**< 86 Metrology Core Parallel I/O Controller A Secure Interupt (named as PIOD) (PIOD_SEC) */
	UART_IRQn            = 87, /**< 87 Optical UART (UART) */
	IPC1_IRQn            = 88, /**< 88 Metrology Core Interprocessor communication (IPC1) (IPC1) */
	MCSPI_IRQn           = 89, /**< 89 Multi-Channel SPI (MCSPI) */
	PWM_IRQn             = 90, /**< 90 Pulse Width Modulation (PWM) */
	ARM1_FPU_IRQn        = 92, /**< 92 Metrology Core (CORE1) Floating Point Unit except IXC (ARM1_FPU) */
	ARM1_IXC_IRQn        = 93, /**< 93 Metrology Core (CORE1) FPU Interrupt IXC associated with FPU cumulative exception bit (ARM1_IXC) */
	MATRIX2_IRQn         = 94, /**< 94 High-Speed Metrology Core Matrix (HSMCM) (Formely MATRIX2) (MATRIX2) */
	MATRIX3_IRQn         = 95, /**< 95 Low-Speed Metrology Core Matrix (LSMCM) (Formely MATRIX3) (MATRIX3) */

	PERIPH_COUNT_IRQn    = 97 /**< Number of peripheral IDs */
} IRQn_Type;

typedef struct _DeviceVectors {
	/* Stack pointer */
	void *pvStack;

	/* Cortex-M handlers */
	void *pfnReset_Handler;
	void *pfnNMI_Handler;
	void *pfnHardFault_Handler;
	void *pfnMemManage_Handler;
	void *pfnBusFault_Handler;
	void *pfnUsageFault_Handler;
	void *pfnReserved1_Handler;
	void *pfnReserved2_Handler;
	void *pfnReserved3_Handler;
	void *pfnReserved4_Handler;
	void *pfnSVC_Handler;
	void *pfnDebugMon_Handler;
	void *pfnReserved5_Handler;
	void *pfnPendSV_Handler;
	void *pfnSysTick_Handler;

	/* Peripheral handlers */
	void *pfnSUPC_Handler;   /*  0 Supply Controller */
	void *pfnRSTC_Handler;   /*  1 Reset Controller */
	void *pfnRTC_Handler;    /*  2 Real Time Clock */
	void *pfnRTT_Handler;    /*  3 Real Time Timer */
	void *pfnDWDT_Handler;   /*  4 Dual Watchdog Timer */
	void *pvReserved5;
	void *pfnPMC_Handler;    /*  6 Power Management Controller */
	void *pfnSEFC0_Handler;  /*  7 Embedded Flash Controller 0 */
	void *pfnSEFC1_Handler;  /*  8 Embedded Flash Controller 1 */
	void *pfnFLEXCOM0_Handler; /*  9 FLEXCOM 0 (USART0/SPI0/TWI0) */
	void *pfnFLEXCOM1_Handler; /* 10 FLEXCOM 1 (USART1/SPI1/TWI1) */
	void *pfnFLEXCOM2_Handler; /* 11 FLEXCOM 2 (USART2/SPI2/TWI2) */
	void *pfnFLEXCOM3_Handler; /* 12 FLEXCOM 3 (USART3/SPI3/TWI3) */
	void *pfnFLEXCOM4_Handler; /* 13 FLEXCOM 4 (USART4/SPI4/TWI4) */
	void *pfnFLEXCOM5_Handler; /* 14 FLEXCOM 5 (USART5/SPI5/TWI5) */
	void *pfnFLEXCOM6_Handler; /* 15 FLEXCOM 6 (USART6/SPI6/TWI6) */
	void *pfnFLEXCOM7_Handler; /* 16 FLEXCOM 7 (USART7/SPI7/TWI7) */
	void *pfnPIOA_Handler;   /* 17 Application Core Parallel I/O Controller A (PIOA) */
	void *pfnPIOA_SEC_Handler; /* 18 Application Core Parallel I/O Controller A (PIOA) Secure Event Interrupt */
	void *pfnPIOB_Handler;   /* 19 Application Core Parallel I/O Controller (B PIOB) */
	void *pfnPIOB_SEC_Handler; /* 20 Application Core Parallel I/O Controller (B PIOB) Secure Event Interrupt */
	void *pfnPIOC_Handler;   /* 21 Application Core Parallel I/O Controller C (PIOC) */
	void *pfnPIOC_SEC_Handler; /* 22 Application Core Parallel I/O Controller C (PIOC) Secure Event Interrupt */
	void *pfnQSPI_Handler;   /* 23 Quad IO Serial Peripheral Interface */
	void *pfnADC_Handler;    /* 24 Analog To Digital Converter */
	void *pfnACC_Handler;    /* 25 Analog Comparator */
	void *pfnARM0_FPU_Handler; /* 26 Application Core (CORE0) Floating Point Unit except IXC */
	void *pfnARM0_IXC_Handler; /* 27 Application Core (CORE0) FPU Interrupt IXC associated with FPU cumulative exception bit */
	void *pfnIPC0_Handler;   /* 28 Application Core Interprocessor communication (IPC0) */
	void *pfnSLCDC_Handler;  /* 29 Segment LCD Controller */
	void *pfnMEM2MEM0_Handler; /* 30 Application Core Memory to Memory Transfer Controller (MEM2MEM0) */
	void *pfnTC0_CHANNEL0_Handler; /* 31 Timer Counter 0, Channel 0 */
	void *pfnTC0_CHANNEL1_Handler; /* 32 Timer Counter 0, Channel 1 */
	void *pfnTC0_CHANNEL2_Handler; /* 33 Timer Counter 0, Channel 2 */
	void *pfnTC1_CHANNEL0_Handler; /* 34 Timer Counter 1, Channel 0 */
	void *pfnTC1_CHANNEL1_Handler; /* 35 Timer Counter 1, Channel 1 */
	void *pfnTC1_CHANNEL2_Handler; /* 36 Timer Counter 1, Channel 2 */
	void *pfnTC2_CHANNEL0_Handler; /* 37 Timer Counter 2, Channel 0 */
	void *pfnTC2_CHANNEL1_Handler; /* 38 Timer Counter 2, Channel 1 */
	void *pfnTC2_CHANNEL2_Handler; /* 39 Timer Counter 2, Channel 2 */
	void *pfnTC0_C0SEC_Handler; /* 40 Timer Counter 0, Channel 0, Secure IRQ */
	void *pfnTC0_C1SEC_Handler; /* 41 Timer Counter 0, Channel 1, Secure IRQ */
	void *pfnTC0_C2SEC_Handler; /* 42 Timer Counter 0, Channel 2, Secure IRQ */
	void *pfnTC1_C0SEC_Handler; /* 43 Timer Counter 1, Channel 0, Secure IRQ */
	void *pfnTC1_C1SEC_Handler; /* 44 Timer Counter 1, Channel 1, Secure IRQ */
	void *pfnTC1_C2SEC_Handler; /* 45 Timer Counter 1, Channel 2, Secure IRQ */
	void *pfnTC2_C0SEC_Handler; /* 46 Timer Counter 2, Channel 0, Secure IRQ */
	void *pfnTC2_C1SEC_Handler; /* 47 Timer Counter 2, Channel 1, Secure IRQ */
	void *pfnTC2_C2SEC_Handler; /* 48 Timer Counter 2, Channel 2, Secure IRQ */
	void *pfnAES_Handler;    /* 49 Advanced Enhanced Standard */
	void *pfnAES_AESSEC_Handler; /* 50 AES Secure Event Interrupt */
	void *pfnAESB_Handler;   /* 51 AES Bridge */
	void *pfnAESB_AESBSEC_Handler; /* 52 AES Bridge Secure Interrupt */
	void *pfnSHA_Handler;    /* 53 Secure Hash Algorithm */
	void *pfnSHA_SHASEC_Handler; /* 54 SHA Secure Event Interrupt */
	void *pfnTRNG_Handler;   /* 55 True Random Generator */
	void *pfnTRNG_TRNGSEC_Handler; /* 56 TRNG Secure Event Interrupt */
	void *pfnICM_Handler;    /* 57 Integrity Check Module */
	void *pfnICM_ICMSEC_Handler; /* 58 Integrity Check Module */
	void *pfnCPKCC_Handler;  /* 59 Public Key Cryptography Controller */
	void *pfnMATRIX0_Handler; /* 60 High-Speed Application Core Matrix (HSACM) (MATRIX0) */
	void *pfnMATRIX1_Handler; /* 61 Low-Speed Application Core Matrix (LSACM) (MATRIX1) */
	void *pfnSUPC_WKUP3_Handler; /* 62 External interrupt 3 */
	void *pfnSUPC_WKUP4_Handler; /* 63 External interrupt 4 */
	void *pfnSUPC_WKUP5_Handler; /* 64 External interrupt 5 */
	void *pfnSUPC_WKUP6_Handler; /* 65 External interrupt 6 */
	void *pfnSUPC_WKUP7_Handler; /* 66 External interrupt 7 */
	void *pfnSUPC_WKUP8_Handler; /* 67 External interrupt 8 */
	void *pfnSUPC_WKUP9_Handler; /* 68 External interrupt 9 */
	void *pfnSUPC_WKUP10_Handler; /* 69 External interrupt 10 */
	void *pfnSUPC_WKUP11_Handler; /* 70 External interrupt 11 */
	void *pfnSUPC_WKUP12_Handler; /* 71 External interrupt 12 */
	void *pfnSUPC_WKUP13_Handler; /* 72 External interrupt 13 */
	void *pfnSUPC_WKUP14_Handler; /* 73 External interrupt 14 */
	void *pfnSUPC_WKUP15_Handler; /* 74 External interrupt 15 */
	void *pvReserved75;
	void *pfnSEAFEC_SLINK_Handler; /* 76 Smart Energy Analog Front-End Controller Serial Link Interrupt */
	void *pfnSEAFEC_DATA_Handler; /* 77 Smart Energy Analog Front-End Controller Data Ready Interrupt */
	void *pfnMEM2MEM1_Handler; /* 78 Metrology Core Memory to Memory Transfer Controller 1 (MEM2MEM1) */
	void *pfnTC3_CHANNEL0_Handler; /* 79 Timer Counter 3, Channel 0 */
	void *pfnTC3_CHANNEL1_Handler; /* 80 Timer Counter 3, Channel 1 */
	void *pfnTC3_CHANNEL2_Handler; /* 81 Timer Counter 3, Channel 2 */
	void *pfnTC3_C0SEC_Handler; /* 82 Timer Counter 3, Channel 0, Secure IRQ */
	void *pfnTC3_C1SEC_Handler; /* 83 Timer Counter 3, Channel 1, Secure IRQ */
	void *pfnTC3_C2SEC_Handler; /* 84 Timer Counter 3, Channel 2, Secure IRQ */
	void *pfnPIOD_Handler;   /* 85 Metrology Core Parallel I/O Controller D (PIOD) */
	void *pfnPIOD_SEC_Handler; /* 86 Metrology Core Parallel I/O Controller A Secure Interupt (named as PIOD) */
	void *pfnUART_Handler;   /* 87 Optical UART */
	void *pfnIPC1_Handler;   /* 88 Metrology Core Interprocessor communication (IPC1) */
	void *pfnMCSPI_Handler;  /* 89 Multi-Channel SPI */
	void *pfnPWM_Handler;    /* 90 Pulse Width Modulation */
	void *pvReserved91;
	void *pfnARM1_FPU_Handler; /* 92 Metrology Core (CORE1) Floating Point Unit except IXC */
	void *pfnARM1_IXC_Handler; /* 93 Metrology Core (CORE1) FPU Interrupt IXC associated with FPU cumulative exception bit */
	void *pfnMATRIX2_Handler; /* 94 High-Speed Metrology Core Matrix (HSMCM) (Formely MATRIX2) */
	void *pfnMATRIX3_Handler; /* 95 Low-Speed Metrology Core Matrix (LSMCM) (Formely MATRIX3) */
	void* pvReserved96;
} DeviceVectors;

/* Cortex-M4 core handlers */
void Reset_Handler        ( void );
void NMI_Handler          ( void );
void HardFault_Handler    ( void );
void MemManage_Handler    ( void );
void BusFault_Handler     ( void );
void UsageFault_Handler   ( void );
void SVC_Handler          ( void );
void DebugMon_Handler     ( void );
void PendSV_Handler       ( void );
void SysTick_Handler      ( void );

/* Peripherals handlers */
void ACC_Handler          ( void );
void ADC_Handler          ( void );
void AES_Handler          ( void );
void AES_AESSEC_Handler   ( void );
void AESB_Handler         ( void );
void AESB_AESBSEC_Handler ( void );
void ARM0_FPU_Handler     ( void );
void ARM0_IXC_Handler     ( void );
void ARM1_FPU_Handler     ( void );
void ARM1_IXC_Handler     ( void );
void CPKCC_Handler        ( void );
void DWDT_Handler         ( void );
void FLEXCOM0_Handler     ( void );
void FLEXCOM1_Handler     ( void );
void FLEXCOM2_Handler     ( void );
void FLEXCOM3_Handler     ( void );
void FLEXCOM4_Handler     ( void );
void FLEXCOM5_Handler     ( void );
void FLEXCOM6_Handler     ( void );
void FLEXCOM7_Handler     ( void );
void ICM_Handler          ( void );
void ICM_ICMSEC_Handler   ( void );
void IPC0_Handler         ( void );
void IPC1_Handler         ( void );
void MATRIX0_Handler      ( void );
void MATRIX1_Handler      ( void );
void MATRIX2_Handler      ( void );
void MATRIX3_Handler      ( void );
void MCSPI_Handler        ( void );
void MEM2MEM0_Handler     ( void );
void MEM2MEM1_Handler     ( void );
void PIOA_Handler         ( void );
void PIOA_SEC_Handler     ( void );
void PIOB_Handler         ( void );
void PIOB_SEC_Handler     ( void );
void PIOC_Handler         ( void );
void PIOC_SEC_Handler     ( void );
void PIOD_Handler         ( void );
void PIOD_SEC_Handler     ( void );
void PMC_Handler          ( void );
void PWM_Handler          ( void );
void QSPI_Handler         ( void );
void RSTC_Handler         ( void );
void RTC_Handler          ( void );
void RTT_Handler          ( void );
void SEAFEC_DATA_Handler  ( void );
void SEAFEC_SLINK_Handler ( void );
void SEFC0_Handler        ( void );
void SEFC1_Handler        ( void );
void SHA_Handler          ( void );
void SHA_SHASEC_Handler   ( void );
void SLCDC_Handler        ( void );
void SUPC_Handler         ( void );
void SUPC_WKUP3_Handler   ( void );
void SUPC_WKUP4_Handler   ( void );
void SUPC_WKUP5_Handler   ( void );
void SUPC_WKUP6_Handler   ( void );
void SUPC_WKUP7_Handler   ( void );
void SUPC_WKUP8_Handler   ( void );
void SUPC_WKUP9_Handler   ( void );
void SUPC_WKUP10_Handler  ( void );
void SUPC_WKUP11_Handler  ( void );
void SUPC_WKUP12_Handler  ( void );
void SUPC_WKUP13_Handler  ( void );
void SUPC_WKUP14_Handler  ( void );
void SUPC_WKUP15_Handler  ( void );
void TC0_CHANNEL0_Handler ( void );
void TC0_CHANNEL1_Handler ( void );
void TC0_CHANNEL2_Handler ( void );
void TC0_C0SEC_Handler    ( void );
void TC0_C1SEC_Handler    ( void );
void TC0_C2SEC_Handler    ( void );
void TC1_CHANNEL0_Handler ( void );
void TC1_CHANNEL1_Handler ( void );
void TC1_CHANNEL2_Handler ( void );
void TC1_C0SEC_Handler    ( void );
void TC1_C1SEC_Handler    ( void );
void TC1_C2SEC_Handler    ( void );
void TC2_CHANNEL0_Handler ( void );
void TC2_CHANNEL1_Handler ( void );
void TC2_CHANNEL2_Handler ( void );
void TC2_C0SEC_Handler    ( void );
void TC2_C1SEC_Handler    ( void );
void TC2_C2SEC_Handler    ( void );
void TC3_CHANNEL0_Handler ( void );
void TC3_CHANNEL1_Handler ( void );
void TC3_CHANNEL2_Handler ( void );
void TC3_C0SEC_Handler    ( void );
void TC3_C1SEC_Handler    ( void );
void TC3_C2SEC_Handler    ( void );
void TRNG_Handler         ( void );
void TRNG_TRNGSEC_Handler ( void );
void UART_Handler         ( void );

/**
 * \brief Configuration of the Cortex-M4 Processor and Core Peripherals 
 */

#define __CM4_REV              0x0001 /**< PIC32CX1025MTC100 core revision number ([15:8] revision number, [7:0] patch number) */
#define __MPU_PRESENT          1      /**< PIC32CX1025MTC100 does provide a MPU */
#define __FPU_PRESENT          1      /**< PIC32CX1025MTC100 does provide a FPU */
#define __NVIC_PRIO_BITS       4      /**< PIC32CX1025MTC100 uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig 0      /**< Set to 1 if different SysTick Config is used */

